**İleri Bİrleştirme (Join) İşlemleri**

In [1]:
import pandas as pd

In [8]:
df1 = pd.DataFrame({'calisanlar':["Ali","Veli","Ayşe","Fatma"],
                   'grup':["mühendislik","muhasebe","muhasebe","İK",]})
df1

  calisanlar         grup
0        Ali  mühendislik
1       Veli     muhasebe
2       Ayşe     muhasebe
3      Fatma           İK

In [9]:
df2 = pd.DataFrame({'calisanlar':["Ayşe","Ali","Veli","Fatma",],
                   'ilk_giris':[2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0       Ayşe       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [10]:
pd.merge(df1,df2, on="calisanlar")

  calisanlar         grup  ilk_giris
0        Ali  mühendislik       2009
1       Veli     muhasebe       2014
2       Ayşe     muhasebe       2010
3      Fatma           İK       2019

**Çoktan Teke**

In [11]:
df3 = pd.merge(df1,df2)

In [12]:
df4 = pd.DataFrame({'grup':['muhasebe','mühendislik','İK'],
                   'mudur':['caner','Mustafa','Berkcan']})
df4

          grup    mudur
0     muhasebe    caner
1  mühendislik  Mustafa
2           İK  Berkcan

In [16]:
pd.merge(df3,df4, on="grup")

  calisanlar         grup  ilk_giris    mudur
0        Ali  mühendislik       2009  Mustafa
1       Veli     muhasebe       2014    caner
2       Ayşe     muhasebe       2010    caner
3      Fatma           İK       2019  Berkcan

**many to many (Çoktan Çoka)**

In [17]:
df5 = pd.DataFrame({'grup':["muhasebe","muhasebe","mühendislik","mühendislik","İK","İK"],
                   'yetenekler': ['matematik','excel','kodlama','linux','excel','yönetim']})
df5

          grup yetenekler
0     muhasebe  matematik
1     muhasebe      excel
2  mühendislik    kodlama
3  mühendislik      linux
4           İK      excel
5           İK    yönetim

In [18]:
df1

  calisanlar         grup
0        Ali  mühendislik
1       Veli     muhasebe
2       Ayşe     muhasebe
3      Fatma           İK

In [19]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali  mühendislik    kodlama
1        Ali  mühendislik      linux
2       Veli     muhasebe  matematik
3       Veli     muhasebe      excel
4       Ayşe     muhasebe  matematik
5       Ayşe     muhasebe      excel
6      Fatma           İK      excel
7      Fatma           İK    yönetim